tap "adoptopenjdk/openjdk"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Record and share terminal sessions
brew "asciinema"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Dependency Manager for PHP
brew "composer"
# Tool for managing dock items
brew "dockutil"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Lossy LZW compression, reduces GIF file sizes by 30-50%
brew "giflossy"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# NCurses Disk Usage
brew "ncdu"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Open-source database for the realtime web
brew "rethinkdb", restart_service: true
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Internet file retriever
brew "wget"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Application launcher and productivity software
cask "alfred"
cask "android-sdk"
# Tools for building Android applications
cask "android-studio"
# Allows connection to a computer remotely
cask "anydesk"
# Online gaming platform
cask "battle-net"
cask "cd-to-terminal"
# Server and cloud storage browser
cask "cyberduck"
# Databases & SQL IDE
cask "datagrip"
# Full-featured desktop app for DevDocs.io
cask "devdocs"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# HTTP and GraphQL Client
cask "insomnia"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualizer
cask "keycastr"
cask "league-of-legends"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
cask "minikube"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# PHP IDE by JetBrains
cask "phpstorm"
# Allows installation and use of software designed for Windows
cask "playonmac"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "screen"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
cask "virustotaluploader"
# Multimedia player
cask "vlc"
# Bit torrent client
cask "vuze"
# JavaScript IDE
cask "webstorm"
# Desktop client for WhatsApp
cask "whatsapp"
mas "Aware", id: 1082170746
mas "Lightshot Screenshot", id: 526298438
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paint S", id: 736473980
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
